# Задание 6. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

line1 = input("Введите первую строку ")
line2 = input("Введите вторую строку ")
print(line1.count(line2))
